Repository: SevarJ/Medication-Reminder
Catalog: Packages/MedicationFeature/Sources/MedicationFeature/Resources/Localizable.xcstrings
Source language: en
Languages: az, ru

# banner.action.openSettings
source: Open Settings
az: Ayarları aç
ru: Открыть настройки

# banner.action.turnOn
source: Turn On Notifications
az: Bildirişləri aktiv et
ru: Включить уведомления

# banner.message.request
source: Turn on notifications so your reminders arrive on time.
az: Xatırlatmaların vaxtında gəlməsi üçün bildirişləri aktiv edin.
ru: Включите уведомления, чтобы напоминания приходили вовремя.

# banner.message.settings
source: Reminders cannot be delivered until notifications are enabled in Settings.
az: Bildirişlər Ayarlarda aktiv edilənə qədər xatırlatmalar gəlməyəcək.
ru: Напоминания не будут приходить, пока уведомления не включены в Настройках.

# banner.title
source: Notifications Are Off
az: Bildirişlər söndürülüb
ru: Уведомления выключены

# common.cancel
source: Cancel
az: Ləğv et
ru: Отмена

# common.delete
source: Delete
az: Sil
ru: Удалить

# common.error.title
source: Something Went Wrong
az: Xəta baş verdi
ru: Что-то пошло не так

# common.save
source: Save
az: Yadda saxla
ru: Сохранить

# common.tryAgain
source: Try Again
az: Yenidən cəhd et
ru: Повторить

# editor.action.addTime
source: Add Time
az: Vaxt əlavə et
ru: Добавить время

# editor.action.delete
source: Delete Medication
az: Dərmanı sil
ru: Удалить лекарство

# editor.error.title
source: Check Your Input
az: Məlumatları yoxlayın
ru: Проверьте данные

# editor.field.amount
source: Amount
az: Miqdar
ru: Количество

# editor.field.dosage
source: Dosage
az: Doza
ru: Дозировка

# editor.field.endDate
source: End Date
az: Bitmə tarixi
ru: Дата окончания

# editor.field.ends
source: Ends
az: Bitmə
ru: Окончание

# editor.field.name
source: Medication name
az: Dərmanın adı
ru: Название лекарства

# editor.field.remindersEnabled
source: Reminders Enabled
az: Xatırlatmalar aktivdir
ru: Напоминания включены

# editor.field.starts
source: Starts
az: Başlama
ru: Начало

# editor.field.unit
source: Unit
az: Vahid
ru: Единица

# editor.repeat.everyDay
source: Every Day
az: Hər gün
ru: Каждый день

# editor.repeat.specificDays
source: Specific Days
az: Seçilmiş günlər
ru: Определённые дни

# editor.section.details
source: Details
az: Məlumatlar
ru: Детали

# editor.section.duration
source: Duration
az: Müddət
ru: Длительность

# editor.section.reminders
source: Reminders
az: Xatırlatmalar
ru: Напоминания

# editor.section.repeat
source: Repeat
az: Təkrar
ru: Повтор

# editor.title.edit
source: Edit Medication
az: Dərmanı redaktə et
ru: Изменить лекарство

# editor.title.new
source: New Medication
az: Yeni dərman
ru: Новое лекарство

# error.doseOutsideEditableRange
source: Doses can only be updated within the last 7 days.
az: Dozaları yalnız son 7 gün ərzində dəyişmək olar.
ru: Изменять приёмы можно только за последние 7 дней.

# error.duplicateTime
source: Reminder times must be different from each other.
az: Xatırlatma vaxtları bir-birindən fərqli olmalıdır.
ru: Время напоминаний не должно повторяться.

# error.generic
source: Something went wrong. Please try again.
az: Xəta baş verdi. Yenidən cəhd edin.
ru: Что-то пошло не так. Попробуйте ещё раз.

# error.invalidAmount
source: Enter a dosage amount greater than zero.
az: Sıfırdan böyük doza daxil edin.
ru: Введите дозировку больше нуля.

# error.invalidDateRange
source: The end date cannot be earlier than the start date.
az: Bitmə tarixi başlama tarixindən əvvəl ola bilməz.
ru: Дата окончания не может быть раньше даты начала.

# error.invalidTime
source: Choose a valid reminder time.
az: Düzgün xatırlatma vaxtı seçin.
ru: Выберите корректное время напоминания.

# error.medicationNotFound
source: This medication no longer exists.
az: Bu dərman artıq mövcud deyil.
ru: Это лекарство больше не существует.

# error.nameEmpty
source: Enter a medication name.
az: Dərmanın adını daxil edin.
ru: Введите название лекарства.

# error.notificationsOff
source: Notifications are turned off, so reminders were not scheduled.
az: Bildirişlər söndürülüb, ona görə xatırlatmalar qurulmadı.
ru: Уведомления выключены, поэтому напоминания не запланированы.

# error.timeUnselected
source: Add at least one reminder time.
az: Ən azı bir xatırlatma vaxtı əlavə edin.
ru: Добавьте хотя бы одно время напоминания.

# error.weekdayUnselected
source: Select at least one day of the week.
az: Həftənin ən azı bir gününü seçin.
ru: Выберите хотя бы один день недели.

# list.action.pause
source: Pause Reminders
az: Xatırlatmaları dayandır
ru: Приостановить напоминания

# list.action.resume
source: Resume Reminders
az: Xatırlatmaları bərpa et
ru: Возобновить напоминания

# list.delete.message
source: Its reminders and dose history will be removed. This can't be undone.
az: Onun xatırlatmaları və doza tarixçəsi silinəcək. Bunu geri qaytarmaq olmaz.
ru: Напоминания и история приёма будут удалены. Это действие нельзя отменить.

# list.delete.title
source: Delete %@?
az: %@ silinsin?
ru: Удалить «%@»?

# list.empty.message
source: Add your first medication to start receiving reminders.
az: Xatırlatmalar almaq üçün ilk dərmanınızı əlavə edin.
ru: Добавьте первое лекарство, чтобы получать напоминания.

# list.empty.title
source: No Medications Yet
az: Hələ dərman yoxdur
ru: Пока нет лекарств

# list.failure.title
source: Could Not Load Medications
az: Dərmanlar yüklənmədi
ru: Не удалось загрузить лекарства

# list.row.paused
source: Paused
az: Dayandırılıb
ru: Приостановлено

# list.section.all
source: All Medications
az: Bütün dərmanlar
ru: Все лекарства

# list.title
source: Medications
az: Dərmanlar
ru: Лекарства

# priming.action.allow
source: Allow Notifications
az: Bildirişlərə icazə ver
ru: Разрешить уведомления

# priming.action.notNow
source: Not Now
az: İndi yox
ru: Не сейчас

# priming.message
source: MedReminder uses notifications to remind you when it's time to take your medication. You can mark doses as taken or snooze them right from the notification.
az: MedReminder dərman vaxtı çatanda xatırlatmaq üçün bildirişlərdən istifadə edir. Dozanı birbaşa bildirişdən qəbul edildi kimi qeyd edə və ya təxirə sala bilərsiniz.
ru: MedReminder присылает уведомления, когда пора принять лекарство. Отмечайте приём или откладывайте напоминание прямо из уведомления.

# priming.title
source: Never Miss a Dose
az: Heç bir dozanı buraxmayın
ru: Не пропускайте приём

# reminder.close
source: Close
az: Bağla
ru: Закрыть

# reminder.eyebrow
source: Time for your medication
az: Dərman vaxtıdır
ru: Время принять лекарство

# reminder.failure.title
source: Could Not Load This Dose
az: Doza yüklənmədi
ru: Не удалось загрузить приём

# reminder.snooze
source: Remind Me in %lld Min
az: %lld dəqiqə sonra xatırlat
ru: Напомнить через %lld мин

# reminder.take
source: I Took It
az: Qəbul etdim
ru: Отметить приём

# schedule.everyDay
source: Every day
az: Hər gün
ru: Каждый день

# schedule.noDays
source: No days selected
az: Gün seçilməyib
ru: Дни не выбраны

# settings.appearance
source: Appearance
az: Görünüş
ru: Оформление

# settings.appearance.dark
source: Dark
az: Tünd
ru: Тёмное

# settings.appearance.light
source: Light
az: Açıq
ru: Светлое

# settings.appearance.system
source: System
az: Sistem
ru: Системное

# settings.language
source: Language
az: Dil
ru: Язык

# settings.language.system
source: System
az: Sistem
ru: Системный

# settings.notifications.notSetUp
source: Not Set Up
az: Qurulmayıb
ru: Не настроены

# settings.notifications.off
source: Off
az: Deaktiv
ru: Выкл.

# settings.notifications.on
source: On
az: Aktiv
ru: Вкл.

# settings.notifications.reminders
source: Reminders
az: Xatırlatmalar
ru: Напоминания

# settings.section.about
source: About
az: Haqqında
ru: О приложении

# settings.section.general
source: General
az: Ümumi
ru: Основные

# settings.section.notifications
source: Notifications
az: Bildirişlər
ru: Уведомления

# settings.title
source: Settings
az: Ayarlar
ru: Настройки

# settings.version
source: Version
az: Versiya
ru: Версия

# today.allDone
source: All of today's doses are taken
az: Bu günün bütün dozaları qəbul edildi
ru: Все дозы на сегодня приняты

# today.dose.markNotTaken
source: Mark as not taken
az: Qeydi ləğv et
ru: Снять отметку

# today.dose.markTaken
source: Mark as taken
az: Qəbul edildi kimi qeyd et
ru: Отметить как принятое

# today.dose.missed
source: Missed
az: Buraxılıb
ru: Не принято

# today.dose.skip
source: Skip
az: Ötür
ru: Пропустить

# today.dose.skipped
source: Skipped
az: Ötürüldü
ru: Пропущено

# today.dose.take
source: Take
az: Qəbul et
ru: Принять

# today.dose.takenAt
source: Taken %@
az: Qəbul edildi %@
ru: Принято в %@

# today.empty.dayTitle
source: Nothing Scheduled
az: Plan yoxdur
ru: Ничего не запланировано

# today.empty.message
source: Medications scheduled for today will appear here.
az: Bu günə planlaşdırılmış dərmanlar burada görünəcək.
ru: Здесь появятся лекарства, запланированные на сегодня.

# today.empty.title
source: Nothing Scheduled Today
az: Bu gün üçün plan yoxdur
ru: На сегодня ничего не запланировано

# today.failure.title
source: Could Not Load Today
az: Bugünkü plan yüklənmədi
ru: Не удалось загрузить план на сегодня

# today.next.takeNow
source: Take Now
az: İndi qəbul et
ru: Принять сейчас

# today.next.title
source: Next dose
az: Növbəti doza
ru: Следующий приём

# today.period.afternoon
source: Afternoon
az: Gündüz
ru: День

# today.period.evening
source: Evening
az: Axşam
ru: Вечер

# today.period.morning
source: Morning
az: Səhər
ru: Утро

# today.progress.taken
source: taken
az: qəbul edildi
ru: принято

# today.progress.week
source: Last 7 days: %@
az: Son 7 gün: %@
ru: За 7 дней: %@

# today.title
source: Today
az: Bu gün
ru: Сегодня

# common.ok
source: OK
ru: ОК

# editor.section.status
source: Status
ru: Статус
